homeTask1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   
    Inlet
    {
       type pressureInletVelocity;
       value uniform (7 0 0);
    }
   
    Outlet
    {
       type pressureInletOutletVelocity;
       value uniform (0 0 0);
    
    }
    Walls {
        type noSlip;
    }

    Front {
      type wedge;
    }

    Back {
      type wedge;
    }



// ************************************************************************* //
