homeTask1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00015;

boundaryField
{
    Inlet
    {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.05;
        value uniform 0;
        
    }
    RightWedge 
    {
        type wedge;
    }
    Outlet
    {
        type inletOutlet;
        inletValue 0;
        value uniform 0;
    }
    Walls {
            type kqRWallFunction;

        }

     Front {
      type wedge;
    }

    Back {
      type wedge;
    }
}




// ************************************************************************* //
