homeTask1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type calculated;
        value uniform 0;
    }
    
    Outlet
    {
        type calculated;
        value uniform 0;
    }
    Walls {
        type nutUWallFunction;
        value uniform 0;
    }

     Front {
      type wedge;
    }

    Back {
      type wedge;
    }
}


// ************************************************************************* //
