homeTask1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



HalfAngle 2.5; //degrees
HalfSin 0.0436332;

convertToMeters 0.001;

r 1.5;
l1 15;
h 1;
l2 3;
l3 28;
R 15; 

vertices
(
    (0 0 0)

    (0 $r 0.06542903414)
    ($l1 $r  0.06542903414)
    ($l1 2.5 0.10904839023)
    (12 2.5 0.109083)
    (12 $R 0.654498)
    ($l1 $R 0.654498)
    (40 $R 0.654498)
    (40 2.5 0.109083)
    (40 $r 0.0654498)
    
    
    (40 0 0)
    ($l1 0 0)

    (0 $r  -0.0654498)
    ($l1 $r  -0.0654498)
    ($l1 2.5 -0.109083)
    (12 2.5 -0.109083)
    (12 $R -0.654498)
    ($l1 $R -0.654498)
    (40 $R -0.654498)
    (40 2.5 -0.109083)
    (40 $r -0.0654498)
);

blocks
(
    hex (0 1 2 11 0 12 13 11) (3 30 1) simpleGrading (1 1 1)
    hex (11 2 9 10 11 13 20 10) (3 50 1) simpleGrading (1 1 1)
    hex (2 3 8 9 13 14 19 20) (2 50 1) simpleGrading (1 1 1)
    hex (4 5 6 3 15 16 17 14) (25 6 1) simpleGrading (1 1 1)
    hex (3 6 7 8 14 17 18 19) (25 50 1) simpleGrading (1 1 1)    
);

edges
(
);

boundary
(
    Walls
    {
        type wall;
        faces
        (
            (3 4 15 14)
            (2 3 14 13)
            (1 2 13 12)
        );
    }
    Inlet
    {
        type patch;
        faces
        (
            (0 1 12 0)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (10 20 9 10)
            (9 20 19 8)
            (8 19 18 7)
            (6 7 18 17)
            (5 6 17 16) 
        );
    }
    Front
    {
        type wedge;
        faces
        (
            (0 11 2 1)
            (11 10 9 2)
            (2 9 8 3)
            (3 8 7 6)
            (4 3 6 5)
        );
    }
    Back
    {
        type wedge;
        faces
        (
            (12 13 11 0)
            (13 20 10 11)
            (14 19 20 13)
            (17 18 19 14)
            (16 17 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
